Revit 2024 API
ExternalServiceOptions Constructor
 Constructs a new ExternalServiceOptions with default settings.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExternalServiceOptions()
Visual Basic
Public Sub New
Visual C++
public:
ExternalServiceOptions()
See Also
ExternalServiceOptions Class
Autodesk.Revit.DB.ExternalService Namespace